// feel free to copy, but do not forget to place a link to http://obfuscator.uo1.net/

function Obfuscator(repl) {
    this.nrepl = 0;
    this.replacements = {};
    this.revreplacements = {};
    
    function removeDupes(str) {
	var rv = "";
	//var p = {};
	for(var i = 0; i < str.length; i++) {
	    var ch = str.charAt(i);
	/*    if (!p[ch]) {
		p[ch] = 1;
		rv += ch;
	    }*/
	    if (rv.indexOf(ch) == -1) {
		rv += ch;
	    }
	}
	return rv;
    }
    
    for(var i = 0; i < repl.length; i++) {
        var r = repl[i];
        var original = r.charAt(0);
        var s = removeDupes(r);
        if (s.length > 1) {
            for(var j = 0; j < s.length; j++) {
                this.replacements[s.charAt(j)] = s.substring(0, j) + s.substring(j + 1);
                if (s.charAt(j) !== original) {
                    this.revreplacements[s.charAt(j)] = original;
                }
                this.nrepl++;
            }
        }
    }
}

Obfuscator.prototype.obfuscate = function(str) {
    var rv = "";
    for(var i = 0; i < str.length; i++) {
        var c = str.charAt(i);
        var r = this.replacements[c];
        if (r) {
            var j = Math.floor(Math.random()*(r.length-1));
            rv += r.charAt(r.charAt(j)==c?j+1:j);
        } else {
            rv += c;
        }
    }
    return rv;
}

Obfuscator.prototype.deobfuscate = function(str) {
    var rv = "";
    for(var i = 0; i < str.length; i++) {
        var c = str.charAt(i);
        var r = this.revreplacements[c];
        if (r) {
            rv += r;
        } else {
            rv += c;
        }
    }
    return rv;
}

var strongObfuscator = new Obfuscator([
    "AÀÁÂÃÄÅĀĂĄǍǞǠȀȂȦΆΑАѦӐӒḀẠẢẤẦẨẬẶἈἉᾈᾉᾸᾹᾺᾼ₳ÅȺẮẰẲẴἌἎἏᾌΆǺẪ",
    "BƁΒВḂḄḆ",
    "CÇĆĈĊČƇʗСҪḈ₢₵ℂⅭϹϾҀ",
    "DÐĎĐƉƊḊḌḎḐḒⅮ",
    "EÈÉÊËĒĔĖĘĚȄȆȨΕЀЁЕӖḘḚḜẸẺẼẾỀỆḔḖỂỄԐℇƐἙῈЄ",
    "FϜḞ₣ҒƑϝғҒ₣",
    "GĜĞĠĢƓǤǦǴḠ₲",
    "HĤĦȞΗНҢҤӇӉḢḤḦḨḪῌꜦ",
    "IΊÌÍÎÏĨĪĬĮİƖƗǏȈȊΙΪІЇӀӏḬḮỈỊἸἹῘῙῚǐ1",
    "JĴʆЈʃ",
    "KĶƘǨΚЌКԞḰḲḴ₭K",
    "LĹĻĽĿŁԼḶḸḺḼℒⅬ˪",
    "MΜМӍḾṀṂⅯ",
    "NÑŃŅŇǸΝṄṆṈṊ₦Ɲ",
    "O0θϑ⍬ÒÓÔÕÖØŌŎŐƆƟƠǑǪǬǾȌȎȪȬȮȰΘΟϴОѲӦӨӪՕỌỎỐỒỔỘỚỜỞỠỢΌΌṌṐṒὈʘṎỖ",
    "PƤΡРҎṔṖῬ₱ℙ",
    "QԚℚ",
    "RŔŖŘȐȒṘṚṜṞ℞ɌⱤ",
    "SŚŜŞŠȘЅՏṠṢṨṤṦ",
    "TŢŤŦƮȚΤТҬṪṬṮṰ₮ȾΊΊꚌ",
    "UÙÚÛÜŨŪŬŮŰŲƯǓǕǗǛȔȖԱՍṲṴṶṸỤỦỨỪỬỮỰǙ⊍⊎Մ⊌Ṻ",
    "VѴѶṼṾ⋁ⅤƲ",
    "WŴԜẀẂẄẆẈ₩ƜШ",
    "XΧХҲẊẌⅩ",
    "Y¥ÝŶŸƳȲΥΫϓУҮҰẎỲỴỶỸῨῩ",
    "ZŹŻŽƵȤΖẐẒẔ",
    "aàáâãäåāăąǎǟǡǻȁȃȧаӑӓḁẚạảấầẩẫậắằẳẵặɑάαἀἁἂἃἄἅἆἇὰάᾀᾁᾂᾃᾄᾅᾆᾇᾰᾱᾲᾳᾴᾶᾷ⍶⍺ɑ",
    "bƀƃƅɒɓḃḅḇþϸƄьҍ",
    "cçćĉċčƈςϛсҫḉⅽ¢ϲҁ",
    "dďđɖɗḋḍḏḑḓⅾƌժ₫ð",
    "eèéêëēĕėęěȅȇȩеѐёҽҿӗḕḗḙḛḝẹẻẽếềểễệεɛϵєϱѳөӫɵ",
    "fſḟẛƒғϝ£ƒ",
    "gĝğġģǥǧǵɠɡգզցḡɕʛɢ",
    "hĥħȟɦɧћիհḣḥḧḩḫẖℏһʜӊ",
    "iį¡ìíîïĩīĭįıǐȉȋɨɩΐίιϊіїɪḭḯỉịἰἱἲἳὶίῑΐῐῒῖὶ",
    "jĵǰȷɟʝјյϳ",
    "kķĸƙǩκкҝҟḱḳḵ",
    "lŀĺļľłƚǀɫɬɭḷḹḻḽŀ⎩ḹ",
    "mɱḿṁṃ₥ⅿ",
    "nɴñńņňŉŋƞǹɲɳήηπпբդըղոռրṅṇṉṋἠἡἢἣἤἥἦἧὴήᾐᾑᾒᾓᾔᾕᾖᾗῂῃῄῆῇი",
    "oòóôõöōŏőơǒǫǭȍȏȫȭȯȱʘοόоӧծձօṍṏṑṓọỏốồổỗộớờởỡợὀὁὂὃὄὅὸόσ๐",
    "pþρрҏթṕṗῤῥ⍴",
    "qʠԛգզϙ",
    "rŕŗřȑȓɼɽгѓґӷṙṛṝṟгѓґӷ",
    "sśŝşšșʂѕԑṡṣṥṧṩ",
    "tţťŧƫțʈṫṭṯṱẗȶէե†ԷՒէȽҭ",
    "uµùúûüũūŭůűųưǔǖǘǚǜȕȗɥμυцկմնսվևṳṵṷṹṻụủứừửữự",
    "vʋνѵѷүұṽṿⅴ∨ΰϋύὐὑὒὓὔὕὖὗὺύῠῡῢΰῦῧʋ",
    "wŵԝẁẃẅẇẉẘ",
    "xϰхҳẋẍⅹ",
    "yýÿŷƴȳγуўӯӱӳẏẙỳỵỷỹʏ",
    "zźżžƶȥʐʑẑẓẕ",
    "2ƻƨշ",
    "3ЗҘӞƷӠЗҘӞՅɜɝзҙӟ",
    "4ЧЧӴ",
    "5Ƽ",
    "6əǝә",
    "8Ց",
    // ☌øǿ - ???
    "БƂ",
    "ГΓЃҐӶ",
    "ЖҖӜ",
    "ИЍӢӤ",
    "ЙҊ",
    "ЛӅԒΛ",
    "ПΠ",
    "ЦҴ",
    "ЬƄ",
    "ЫӸ",
    "ЪѢՒ",
    "ЭӬ",
    "вʙʙɞ",
    "жҗӂӝ",
    "зƨɜɝӟ",
    "иѝӥ",
    "йҋӣ",
    "кĸκќқҝҟҡԟ",
    "лӆԓ",
    "мӎ",
    "нʜңҥӈӊ",
    "цџҵ",
    "чҷҹӌӵ",
    "шɯա",
    "ъѣ",
    "ыӹ",
    "эǝɘəӭэӭ"
    ]);

var deObfuscator = {
    strongObfuscator: strongObfuscator,
    obfuscate: function(str) {
        return this.strongObfuscator.deobfuscate(str);
    }
};

var niceObfuscator = new Obfuscator([
    "AÀÁÂÃÄÅĀĂĄǍǞǠȀȂȦΆΑАѦӐӒḀẠẢẤẦẨẬẶἈἉᾈᾉᾸᾹᾺᾼ₳ÅȺẮẰẲẴἌἎἏᾌΆǺẪ",
    "BƁΒВḂḄḆ",
    "CÇĆĈĊČƇСҪḈ₢₵ℂⅭϹϾҀ",
    "DÐĎĐƉƊḊḌḎḐḒⅮ",
    "EÈÉÊËĒĔĖĘĚȄȆȨΕЀЁЕӖḘḚḜẸẺẼẾỀỆḔḖỂỄԐℇƐἙῈЄ",
    "FϜḞ₣ҒƑҒ₣",
    "GĜĞĠĢǤǦǴḠ₲",
    "HĤȞΗНҢҤӇӉḢḤḦḨḪῌꜦ",
    "IΊÌÍÎÏĨĪĬĮİƖƗǏȈȊΙΪІЇӀӏḬḮỈỊἸἹῘῙῚǐ1",
    "JĴЈ",
    "KĶƘǨΚЌКԞḰḲḴ₭K",
    "LĹĻĽĿŁԼḶḸḺḼℒⅬ˪",
    "MΜМӍḾṀṂⅯ",
    "NÑŃŅŇǸΝṄṆṈṊƝ",
    "O0ÒÓÔÕÖŌŎŐƠǑǪǬȌȎȪȬȮȰΘΟОӦՕỌỎỐỒỔỘỚỜỞỠỢΌΌṌṐṒὈṎỖ",
    "PΡРṔṖῬ",
    "QԚℚ",
    "RŔŖŘȐȒṘṚṜṞ",
    "SŚŜŞŠȘЅՏṠṢṨṤṦ",
    "TŢŤŦȚΤТṪṬṮṰ",
    "UÙÚÛÜŨŪŬŮŰǓǕǗǛȔȖṲṴṶṸỤỨỪỮỰǙṺ",
    "VѴѶṼṾ⋁Ⅴ",
    "WŴԜẀẂẄẆẈ",
    "XΧХҲẊẌⅩ",
    "YÝŶŸƳȲΥΫУҮҰẎỲỴỶỸῨῩ",
    "ZŹŻŽƵȤΖẐẒẔ",
    "άαἀἁἂἃἄἅἆἇὰάᾀᾁᾂᾃᾄᾅᾆᾇᾰᾱᾲᾳᾴᾶᾷ⍶⍺",
    "aàáâãäåāăąǎǟǡǻȁȃȧаӑӓḁẚạảấầẩẫậắằẳẵặ",
    "bƀƃƅɓḃḅḇþϸ",
    "cçćĉċčƈςϛсҫḉⅽϲ",
    "dďɗḋḍḏḑḓⅾ",
    "eèéêëēĕėęěȅȇȩеѐёӗḕḗḙḛḝẹẻẽ",
    "fḟẛϝƒ",
    "gĝğġģǥǧǵɠɡցḡ",
    "hĥħȟɦիհḣḥḧḩḫẖһ",
    "iį¡ìíîïĩīĭįıǐȉȋɨɩΐίιϊіїɪḭḯỉịἰἱἲἳὶίῑΐῐῒῖὶ",
    "jĵǰȷɟʝјյϳ",
    "kķĸƙǩκкҝҟḱḳḵ",
    "lŀĺļľłƚǀɫɬɭḷḹḻḽŀ⎩ḹ",
    "mɱḿṁṃ₥ⅿ",
    "nñńņňŉǹήηոռրṅṇṉṋἠἡἢἣἤἥἦἧὴήᾐᾑᾒᾓᾔᾕᾖᾗῂῃῄῆῇ",
    "oòóôõöōŏőơǒǫǭȍȏȫȭȯȱʘοόоӧծձօṍṏṑṓọỏốồổỗộớờởỡợὀὁὂὃὄὅὸόσ๐",
    "pþρрҏṕṗῤῥ⍴",
    "qԛգզ",
    "rŕŗřȑȓɼɽгѓґӷṙṛṝṟгѓґӷ",
    "sśŝşšșʂѕṡṣṥṧṩ",
    "tţťŧƫțʈṫṭṯṱẗȶէեԷէȽ",
    "uµùúûüũūŭůűųưǔǖǘǚǜȕȗɥμկմնսվևṳṵṷṹṻụủứừửữự",
    "vʋνѵѷүұṽṿⅴ∨ΰϋύὐὑὒὓὔὕὖὗὺύῠῡῢΰῦῧʋ",
    "wŵԝẁẃẅẇẉẘ",
    "xϰхҳẋẍ",
    "yýÿŷƴȳγуўӯӱӳẏẙỳỵỷỹ",
    "zźżžƶȥʐʑẑẓẕ",
    "2ƻƨշ",
    "3ЗҘӞƷӠЗҘӞՅɜɝзҙӟ",
    "4ЧЧӴ",
    "5Ƽ",
    "6əǝә",
    "8Ց",
    // ☌øǿ - ???
    "БƂ",
    "ГΓЃҐӶ",
    "ЖҖӜ",
    "ИЍӢӤ",
    "ЙҊ",
    "ЛӅԒ",
    "ПΠ",
    "ЦҴ",
    "ЬƄ",
    "ЫӸ",
    "ЪѢՒ",
    "ЭӬ",
    "вʙʙɞ",
    "жҗӂӝ",
    "зƨɜɝӟ",
    "иѝӥ",
    "йҋӣ",
    "кĸκќқҝҟҡԟ",
    "лӆԓ",
    "мӎ",
    "нʜңҥӈӊ",
    "цџҵ",
    "чҷҹӌӵ",
    "шɯա",
    "ъѣ",
    "ыӹ",
    "эǝɘəӭэӭ"
    ]);

var weakObfuscator = new Obfuscator([
        "AÁΑАᎪ",
    "BΒВᏴ",
    "CĈČСᏟⅭ",
    "DĎᎠⅮ",
    "EÊĚΕЀЕӖᎬẸỆ",
    "GĜǴᏀ",
    "HΗНᎻ",
    "IÎǏΙІӀӏⅠ",
    "JЈᎫ",
    "KΚᏦK",
    "LᏞⅬ",
    "MΜМⅯ",
    "NΝ",
    "OÔǑΟОӦՕ",
    "PΡРᏢṖῬ",
    "QԚ",
    "RŔŘᎡ",
    "SŠЅՏᏚ",
    "TŤΤТᎢ",
    "UՍ",
    "VᏙ",
    "WԜ",
    "XΧХⅩ",
    "YΥҮ",
    "ZŹŽΖᏃẐ",
    "aа",
    "bḃ",
    "cсⅽ",
    "dḋⅾ",
    "eе℮",
    "f",
    "gģǵց",
    "hḣ",
    "iіⅰ",
    "jј",
    "lⅼ",
    "mⅿ",
    "nո",
    "oοоօ",
    "pр",
    "qԛ",
    "sѕտ",
    "uս",
    "vⅴ",
    "wԝ",
    "xхⅹ",
    "yу",
    "БƂ",
    "ГΓЃᎱ",
    "ЙӢ",
    "ПΠ",
    "ЬᏏ",
    "зɜ",
    "йӣ",
    "кĸκ"
    ]);

var perfectObfuscator = new Obfuscator([
    "AΑА",
    "BΒВᏴ",
    "CСᏟⅭ",
    "DᎠⅮ",
    "EΕЕᎬ",
    "GᏀ",
    "HΗНᎻ",
    "IΙІӀӏⅠ",
    "JЈᎫ",
    "KΚᏦK",
    "LᏞⅬ",
    "MΜМⅯ",
    "NΝ",
    "OΟОՕ",
    "PΡРᏢῬ",
    "QԚ",
    "RᎡ",
    "SЅՏᏚ",
    "TΤТᎢ",
    "UՍ",
    "VᏙ",
    "WԜ",
    "XΧХⅩ",
    "YΥҮ",
    "ZΖᏃ",
    "aа",
    "cсⅽ",
    "dⅾ",
    "eе",
    "f",
    "gց",
    "iіⅰ",
    "jј",
    "lⅼ",
    "mⅿ",
    "nո",
    "oοоօ",
    "pр",
    "qԛ",
    "sѕտ",
    "uս",
    "vⅴ",
    "wԝ",
    "xхⅹ",
    "yу",
    "БƂ",
    "ГΓᎱ",
    "ЙӢ",
    "ПΠ",
    "ЬᏏ",
    "зɜ",
    "йӣ",
    "кĸκ"
    ]);

var leetObfuscator = {
    alphabet: {
        'a': ['4', '/-\\', '/\\', '@', '^', 'λ', '∂', 'q', 'α'],
        'b': ['|3', '8', '|o', 'ß', 'l³', '|>', '13', 'J3'],
        'c': ['(', '[', '<', '©', '¢'],
        'd': ['|)', '|]', 'o|', '|>', '<|', 'Ð', 'đ', '1)'],
        'e': ['3', '€', '&', '£', 'ε'],
        'f': ['|=', 'PH', 'ƒ', '|"', 'l²'],
        'g': ['6', '9', '&'],
        'h': ['4', '|-|', '#', '}{', ']-[', '/-/', ')-('],
        'i': ['l', '1', '|', '!', '][', 'ỉ'],
        'j': ['_|', '¿'],
        'k': ['|<', '|{', '|(', 'X'],
        'l': ['1', '|_', '£', '|', '1', '][_'],
        'm': ['|\\/|', '/\\/\\', '|\'|\'|', '/v\\', ']V[', 'AA',
            '[]V[]', '|11', '/|\\', '^^', '(V)', '|Y|'],
        'n': ['|\\|', '/\\/', '/|/', '/V', '|V', '/\\\\/', '|1', '2', '?', '(\\)', '11', 'r'],
        'o': ['0', '9', '()', '[]', '*', '°', '<>', 'ø', '{[]}'],
        'p': ['9', '|°', 'p', '|>', '|*', '|2', '|D', '][D', '|²', '|?'],
        'q': ['(,)', 'kw', '0_', '0,'],
        'r': ['2', '|2', '1²', '®', '|Z', '|?', '?', 'я', '12', '.-'],
        's': ['5', '$', '§', '?', 'ŝ', 'ş'],
        't': ['+', '\'][\'', '7', '†', '|'],
        'u': ['|_|', 'µ', '[_]', 'v'],
        'v': ['|/', '\\|', '\\/', '\\\''],
        'w': ['\\/\\/', '\\|\\|', '|/|/', '\\|/', 'VV', '\\A/', '\\\\\'', 'uu', '\\^/', 'uJ'],
        'x': ['><', ')(', '}{', '%', '?', '×', ']['],
        'y': ['`/', '\'/', 'j', '°/', '¥'],
        'z': ['2', '(\\)', 'z', '"/_'],
        'ä': ['43', '°A°', '°4°'],
        'ö': ['03', '°O°'],
        'ü': ['|_|3', '°U°'],
        '1': ['1', 'one'],
        '2': ['2', 'to', 'too'],
        '3': ['3', 'drei', 'three'],
        '4': ['4', 'for'],
        '8': ['8', 'eight', '-aite', '-ate'],
        '9': ['9', 'nine']
    },
    obfuscate: function(str) {
        var r = "";
        for(var i = 0; i < str.length; i++) {
            var c = str.charAt(i);
            var repl = this.alphabet[c];
            if (repl === undefined) {
                r += c;
            } else {
                r += repl[Math.floor(Math.random()*(repl.length-1))];
            }
        }
        return r;
    }
};

module.exports = {
  PerfectObfuscator: perfectObfuscator,
  StrongObfuscator: strongObfuscator,
  NiceObfuscator: niceObfuscator,
  LeetObfuscator: leetObfuscator,
  WeakObfuscator: weakObfuscator
};
